eisup_2019_docmng_integration/src/Catalogs/НастройкиОбменаССайтом/НастройкиОбменаССайтом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиОбменаССайтом</name>
  <attributes>
    <name>ОбменТоварами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменЗаказами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УзелОбменаТоварами</name>
    <type>
      <types>ExchangePlanRef.ОбменССайтомТоварами</types>
    </type>
  </attributes>
  <attributes>
    <name>УзелОбменаЗаказами</name>
    <type>
      <types>ExchangePlanRef.ОбменССайтомЗаказами</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьТолькоИзменения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьНаСайт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогВыгрузки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>HTTPОбменАдресСайта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HTTPОбменИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HTTPОбменПароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HTTPОбменПроксиИспользование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>HTTPОбменПроксиСервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HTTPОбменПроксиПорт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HTTPОбменПроксиИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HTTPОбменПроксиПароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДляНовыхКонтрагентов</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДляНовойНоменклатуры</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписыватьДокументыТекущейДатой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитьДокументы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитьДокументыОперативно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособИдентификацииКонтрагентов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияНовойНоменклатуры</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>СохраненныеНастройкиПостроителя</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьКартинки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РегламентноеЗадание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьРегламентныеЗадания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Catalogs/НастройкиОбменаССайтом/ObjectModule.bsl
Перем мРегламентноеЗадание Экспорт;

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ОбменТоварами 
		И НЕ ОбменЗаказами Тогда
		
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Должен быть выбран хотя бы один из режимов выгрузки: ""Выгрузка товаров"" или ""Обмен заказами""!", Отказ);
		
	КонецЕсли;
	
	Если ВыгружатьНаСайт Тогда
		
		Если Не ЗначениеЗаполнено(HTTPОбменАдресСайта) Тогда
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Не указан WEB - сайт для обмена данными!", Отказ);
		КонецЕсли;
		
	Иначе
		
		Если Не ЗначениеЗаполнено(КаталогВыгрузки) Тогда
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Не указан каталог для обмена данными!", Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВыгружатьТолькоИзменения Тогда
		
		Если ОбменТоварами И НЕ ЗначениеЗаполнено(УзелОбменаТоварами) ТОгда
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Узел плана обмена для контроля изменений товаров не указан!", Отказ);
		КонецЕсли;
		
		Если ОбменЗаказами И НЕ ЗначениеЗаполнено(УзелОбменаЗаказами) ТОгда
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Узел плана обмена для контроля изменений заказов не указан!", Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьЗначенияПеременныхРегламентныхНастроек();
	
	Если ПометкаУдаления
		ИЛИ НЕ ИспользоватьРегламентныеЗадания Тогда
		
		Если мРегламентноеЗадание <> Неопределено Тогда
			мРегламентноеЗадание.Использование = Ложь;			
		КонецЕсли;		
					
	Иначе
		
		// если оба выключены регл задания - то включаем основное регл задание
		Если мРегламентноеЗадание = Неопределено Тогда
			
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Не выбрано регламентное задание для настройки обмена.", Отказ);
				
		КонецЕсли;			
				
		Если мРегламентноеЗадание <> Неопределено Тогда
			
			мРегламентноеЗадание.Использование = Истина;
						
		КонецЕсли;
			
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если мРегламентноеЗадание <> Неопределено 
		И Не ПустаяСтрока(мРегламентноеЗадание.Ключ) Тогда
		
		КлючРегламентногоЗадания = мРегламентноеЗадание.Ключ;
		
	Иначе
		
		КлючРегламентногоЗадания = Строка(Новый УникальныйИдентификатор);
		
	КонецЕсли;
	
	УстановитьПараметрыРегламентногоЗадания(РегламентноеЗадание, мРегламентноеЗадание, КлючРегламентногоЗадания);
	
	Если ВыгружатьНаСайт Тогда
		КаталогВыгрузки = "";
	Иначе
		HTTPОбменАдресСайта = "";
	КонецЕсли;
		
КонецПроцедуры

Процедура УстановитьПараметрыРегламентногоЗадания(РеквизитЗадания, ПараметрЗадания, КлючРегламентногоЗадания, Постфикс = "")
	
	Если ПараметрЗадания = Неопределено Тогда
		
		РеквизитЗадания = "";
		
	Иначе	
		
		РеквизитЗадания = Строка(ПараметрЗадания.УникальныйИдентификатор);
		
		ПараметрЗадания.Наименование = Наименование + Постфикс;
		// генерируем уникальный ключ, что бы в один момент времени 2 регламентных задания не выполнялись
		Если ПустаяСтрока(ПараметрЗадания.Ключ) Тогда
			ПараметрЗадания.Ключ = КлючРегламентногоЗадания;
		КонецЕсли;
		
		Массив = Новый Массив();
		Массив.Добавить(Код);
		
		ПараметрЗадания.Параметры = Массив;
		ПараметрЗадания.Записать();	
					
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	мРегламентноеЗадание = Неопределено;
	РегламентноеЗадание = "";
	
КонецПроцедуры

Процедура ЗаполнитьПоУмолчанию() Экспорт
	
	ПроцедурыОбменаДанными.ЗаполнитьНастройкуОбменаWEBЗначениямиПоУмолчанию(ЭтотОбъект);
			
КонецПроцедуры

Процедура УстановитьРежимРегламетныхЗадач() Экспорт
	
	УстановитьЗначенияПеременныхРегламентныхНастроек();
	
	Если мРегламентноеЗадание = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если мРегламентноеЗадание.Использование = Истина Тогда
		
		Возврат;
		
	КонецЕсли;
	
	мРегламентноеЗадание.Использование = Ложь;
		
	мРегламентноеЗадание.Записать();
		
КонецПроцедуры

Функция НайтиРеглЗаданиеПоПараметру(УникальныйНомерЗадания)
	
	Попытка
		
		Если НЕ ПустаяСтрока(УникальныйНомерЗадания) Тогда
			
			УникальныйИдентификаторЗадания = Новый УникальныйИдентификатор(УникальныйНомерЗадания);
			ТекущееРегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(УникальныйИдентификаторЗадания);
			
		Иначе
			
			ТекущееРегламентноеЗадание = Неопределено;
			
		КонецЕсли;
		
	Исключение
		
		ТекущееРегламентноеЗадание = Неопределено;
		
    КонецПопытки;
	
	Возврат ТекущееРегламентноеЗадание;
	
КонецФункции

Функция НайтиРегламентноеЗаданиеПоНастройке() Экспорт
	
	ТекущееРегламентноеЗадание = НайтиРеглЗаданиеПоПараметру(РегламентноеЗадание);
	
	Возврат ТекущееРегламентноеЗадание;
	
КонецФункции

Функция ПолучитьОбъектРегламентногоЗадания() Экспорт
	
	Задание = НайтиРегламентноеЗаданиеПоНастройке();
	
	Возврат Задание;	
	
КонецФункции


Процедура УстановитьЗначенияПеременныхРегламентныхНастроек() Экспорт
	
	Если мРегламентноеЗадание = Неопределено Тогда
		
		мРегламентноеЗадание = ПолучитьОбъектРегламентногоЗадания();
			
	КонецЕсли;	
		
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	УстановитьЗначенияПеременныхРегламентныхНастроек();
	
	Если мРегламентноеЗадание <> Неопределено Тогда
		мРегламентноеЗадание.Удалить();
	КонецЕсли;
	
КонецПроцедуры
